export default {
    "ra": {
        "action": {
            "add_filter": "Добавить фильтр",
            "add": "Добавить",
            "back": "Назад",
            "bulk_actions": "Выбрана 1 позиция  |||| %{smart_count} выбрано",
            "cancel": "Отменить",
            "clear_array_input": "Очистить список",
            "clear_input_value": "Очистить значение",
            "clone": "Клонировать",
            "confirm": "Подтвердить",
            "create": "Создать",
            "create_item": "Создать %{item}",
            "delete": "Удалить",
            "edit": "Редактировать",
            "export": "Экспорт",
            "list": "Список",
            "refresh": "Обновить",
            "remove_filter": "Удалить фильтр",
            "remove_all_filters": "Удалить все фильтры",
            "remove": "Удалить",
            "save": "Сохранить",
            "search": "Поиск",
            "select_all": "Выбрать все",
            "select_row": "Выбрать эту строку",
            "show": "Показать",
            "sort": "Сортировать",
            "undo": "Назад",
            "unselect": "Отменить выбор",
            "expand": "Расширить",
            "close": "Закрыть",
            "open_menu": "Открыть меню",
            "close_menu": "Закрыть меню",
            "update": "Обновить",
            "move_up": "Поднять вверх",
            "move_down": "Опустить ниже",
            "open": "Открыть",
            "toggle_theme": "Сменить тему",
            "select_columns": "Колонки",
            "update_application": "Перезапустить приложение"
        },
        "boolean": {
            "true": "Да",
            "false": "Нет",
            "null": " "
        },
        "page": {
            "create": "Создать %{name}",
            "dashboard": "Дашборд",
            "edit": "%{name} %{recordRepresentation}",
            "error": "Что-то пошло не так",
            "list": "%{name}",
            "loading": "Загрузка",
            "not_found": "Не найдено",
            "show": "%{name} %{recordRepresentation}",
            "empty": "Уже не существует %{name}.",
            "invite": "Вы хотите добавить еще?"
        },
        "input": {
            "file": {
                "upload_several": "Перетащите несколько файлов для загрузки или нажмите, чтобы выбрать один.",
                "upload_single": "Перетащите файл для загрузки или щелкните его, чтобы выбрать."
            },
            "image": {
                "upload_several": "Перетащите несколько изображений для загрузки или нажмите, чтобы выбрать одно.",
                "upload_single": "Перетащите изображение для загрузки или щелкните, чтобы выбрать его."
            },
            "references": {
                "all_missing": "Не удалось найти справочные данные.",
                "many_missing": "По крайней мере одна из связанных ссылок больше не доступна.",
                "single_missing": "Соответствующая ссылка больше не доступна."
            },
            "password": {
                "toggle_visible": "Скрыть пароль",
                "toggle_hidden": "Показать пароль"
            }
        },
        "message": {
            "about": "О",
            "are_you_sure": "Вы уверены?",
            "auth_error": "Произошла ошибка при проверке токена аутентификации.",
            "bulk_delete_content": "Вы уверены, что хотите удалить %{name}? |||| Вы уверены, что хотите удалить эти элементы %{smart_count}?",
            "bulk_delete_title": "Удалить %{name} |||| Удалить %{smart_count} %{name}",
            "bulk_update_content": "Вы уверены, что хотите обновить этот %{name}? |||| Вы уверены, что хотите обновить эти элементы %{smart_count}?",
            "bulk_update_title": "Обновить %{name} |||| Обновить %{smart_count} %{name}",
            "clear_array_input": "Вы уверены, что хотите очистить весь список?",
            "delete_content": "Вы уверены, что хотите удалить этот элемент?",
            "delete_title": "Удалить %{name} #%{id}",
            "details": "Подробности",
            "error": "Произошла ошибка клиента, и ваш запрос не удалось выполнить.",
            "invalid_form": "Форма недействительна. Пожалуйста, проверьте наличие ошибок",
            "loading": "Ожидайте",
            "no": "Нет",
            "not_found": "Либо вы ввели неправильный URL-адрес, либо перешли по неверной ссылке.",
            "yes": "Да",
            "unsaved_changes": "Некоторые из ваших изменений не были сохранены. Вы уверены, что хотите их игнорировать?"
        },
        "navigation": {
            "no_results": "Результатов не найдено",
            "no_more_results": "Номер страницы %{page} выходит за пределы. Попробуйте предыдущую страницу.",
            "page_out_of_boundaries": "Номер страницы %{page} выходит за границы",
            "page_out_from_end": "Невозможно перейти к последней странице",
            "page_out_from_begin": "Невозможно перейти раньше страницы 1",
            "page_range_info": "%{offsetBegin}-%{offsetEnd} из %{total}",
            "partial_page_range_info": "%{offsetBegin}-%{offsetEnd} более %{offsetEnd}",
            "current_page": "Страница %{page}",
            "page": "Перейти на страницу %{page}",
            "first": "Перейти на первую страницу",
            "last": "Перейти на последнюю страницу",
            "next": "Перейти на следующую страницу",
            "previous": "Перейти на предыдущую страницу",
            "page_rows_per_page": "Строк на странице:",
            "skip_nav": "Перейти к содержимому"
        },
        "sort": {
            "sort_by": "Сортировать по %{field} %{order}",
            "ASC": "по возрастанию",
            "DESC": "нисходящий"
        },
        "auth": {
            "auth_check_error": "Пожалуйста, войдите, чтобы продолжить",
            "user_menu": "Профиль",
            "username": "Имя пользователя",
            "пароль": "Пароль",
            "sign_in": "Войти",
            "sign_in_error": "Аутентификация не удалась, повторите попытку",
            "выход": "Выход"
        },
        "notification": {
            "updated": "Элемент обновлен |||| %{smart_count} элементов обновлен",
            "created": "Элемент создан",
            "deleted": "Элемент удален |||| %{smart_count} элементов удалено",
            "bad_item": "Неправильный элемент",
            "item_doesnt_exist": "Элемент не существует",
            "http_error": "Ошибка связи с сервером",
            "data_provider_error": "Ошибка dataProvider. Подробности проверьте в консоли.",
            "i18n_error": "Невозможно загрузить переводы для указанного языка",
            "cancelled": "Действие отменено",
            "logged_out": "Ваша сессия завершилась, пожалуйста, подключитесь заново.",
            "not_authorized": "У вас нет доступа к этому ресурсу.",
            "application_update_available": "Доступна новая версия."
        },
        "validation": {
            "обязательно": "Обязательно",
            "minLength": "Должно быть не менее %{min} символов",
            "maxLength": "Должно быть %{max} символов или меньше",
            "minValue": "Должно быть не менее %{min}",
            "maxValue": "Должно быть %{max} или меньше",
            "number": "Должно быть число",
            "email": "Должен быть действительный адрес электронной почты",
            "oneOf": "Должен быть одним из: %{options}",
            "regex": "Должен соответствовать определенному формату (регулярному выражению): %{pattern}",
            "unique": "Должно быть уникальным"
        },
        "saved_queries": {
            "label": "Сохраненные запросы",
            "query_name": "Имя запроса",
            "new_label": "Сохранить текущий запрос...",
            "new_dialog_title": "Сохранить текущий запрос как",
            "remove_label": "Удалить сохраненный запрос",
            "remove_label_with_name": "Удалить запрос \"%{name}\"",
            "remove_dialog_title": "Удалить сохраненный запрос?",
            "remove_message": "Вы уверены, что хотите удалить этот элемент из списка сохраненных запросов?",
            "help": "Отфильтруйте список и сохраните этот запрос на будущее"
        },
        "configurable": {
            "customize": "Настроить",
            "configureMode": "Настроить эту страницу",
            "inspector": {
                "title": "Инспектор",
                "content": "Наведите курсор на элементы пользовательского интерфейса приложения, чтобы настроить их",
                "reset": "Сбросить настройки",
                "hideAll": "Скрыть все",
                "showAll": "Показать все"
            },
            "Datagrid": {
                "title": "Сетка данных",
                "unlabeled": "Столбец без метки #%{column}"
            },
            "SimpleForm": {
                "title": "Форма",
                "unlabeled": "Немаркированный вход #%{input}"
            },
            "SimpleList": {
                "title": "Список",
                "primaryText": "Основной текст",
                "вторичныйТекст": "Вторичный текст",
                "tertiaryText": "Третичный текст"
            }
        }
    },
    "users": {
        "labels": {
            "id": "Id",
            "client": "Клиент",
            "firstName": "Имя",
            "lastName": "Фамилия",
            "personType": "Тип пользователя",
            "email": "Почта пользователя",
            "login": "Логин"
        }
    },
    "resources":{
        "users":{
            "name": "Пользователи",
        }
    }
}